app/views/sessions/new.html.erb

SELECT "users".* FROM "users"
---
  <%= f.label :name, "Your name:" %>
  <%= f.collection_select :name, User.all, :name, :name, include_blank: true %>