app/controllers/sessions_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Ryan"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(name: params[:user_name])