app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "happiness", "nausea", "height", "tickets") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ryan"], ["password_digest", "$2a$12$5hff6KrM/FcxLKVh4k0DF.JaovQTwCkrxEqC6dYnq8FXTfkYrRDDq"], ["happiness", 3], ["nausea", 1], ["height", 56], ["tickets", 50]]